/**
 * 공통 메세지 정의
 */
;(function ( $ ) {
	'use strict';

	/** ========== Messages ========== */

	AP.message = {
			API_SAVE_ERROR: '정상적으로 처리되지 않았습니다.<br>잠시 후 다시 이용해 주시기 바랍니다.',
			PRODUCT_IN_CART: '장바구니에 담긴 상품입니다.',
			NONE_SELECTED_PRODUCT: '상품을 선택해 주세요.',
			NONE_SELECTED_OPTION: '옵션을 선택해 주세요.',
			OUT_OF_STOCK_PRODUCT: '판매 종료된 상품입니다.',
			IN_OUT_OF_STOCK_PRODUCT: '품절된 상품이 포함되어있습니다.',
			IN_INVALID_TAKEOUT_PRODUCT: '테이크아웃으로 구매하실 수 없는 상품이 포함되어 있습니다.',
			IN_INVALID_BEAUTYPOINT_PRODUCT: '뷰티포인트로 구매할 수 없는 상품이 포함되어 있습니다.',
			ADDED_CART_TO_CART_PAGE: '선택하신 상품이 장바구니에<br>추가되었습니다.<br>장바구니로 이동하시겠습니까?',
			RESTOCK_NOTIFY_APPLY_SUCCESS: '입고알림 신청이 완료되었습니다.',
			DUPLICATE_SELECTED_PRODUCT: '이미 선택되어 있는 옵션입니다.<br>수량을 변경해 주세요.',
			DUPLICATE_SELECTED_PRODUCT2: '이미 선택되어 있는 옵션입니다.',
			SAME_TIME_SELECTED_ALL_PRODUCT : '$1 상품을 모두 선택 후 구매 시도해 주세요.',
			SAME_TIME_SELECTED_PRODUCT_COUNT : '[$1] 상품의 수량 조합이 맞지 않습니다. 그룹별 기준 수량을 맞춰주세요.',
			CART_OUT_OF_STOCK_PRODUCT : '판매중인 상품이 아니거나 재고가 부족합니다.',
			SEARCH_WORD_EMPTY : '검색어를 입력해 주세요',
			EAPI004 : '회원 정보가 확인되지 않습니다. <br>고객센터에 문의해주세요.',
			/*ESAL001 : '회원 정보가 확인되지 않습니다. <br>고객센터에 문의해주세요.',*/
			ESAL001 : '회원 계정이 잠겨 있습니다. <br>고객센터에 문의해주세요.',
			ESAL006 : '포인트의 적립한도를 초과하여 적립할 수 없습니다.',
			ESAL008 : '대표 배송지는 삭제할 수 없습니다.',
			ESAL009 : '저장가능한 배송지 수를 초과했습니다.',
			ESAL010 : '이미 취소되었습니다.',
			ESAL011 : '이미 만료되었습니다.',
			ESAL013 : '이미 시행일자가 경과했습니다.',
			ESAL014 : '이미 연결된 계정입니다.',
			ESAL020 : '라이브 아티클이 존재하지 않습니다.',
			ESAL021 : '본인의 글만 수정할 수 있습니다.',
			ESAL022 : '본인의 글만 삭제할 수 있습니다.',
			ESAL025 : '삭제된 댓글입니다.',
			ESAL028 : '전시기간이 아닙니다.',
			ESAL030 : '이벤트가 마감 되었습니다.',
			ESAL031 : '참여횟수를 초과하였습니다.',
			ESAL032 : '이벤트 기간이 아닙니다.',
			ESAL033 : '아쉽네요. 다음 기회를 도전해보세요.',
			ESAL034 : '증정 혜택이 확인되지 않습니다. 고객센터에 문의해주세요.',
			ESAL035 : '죄송합니다. 증정품이 모두 소진되었습니다.',
			ESAL036 : '유효하지 않은 응모번호입니다.',
			ESAL037 : '금일 참여횟수를 초과하였습니다.',
			ESAL039 : '출석체크 이력이 없습니다.',
			ESAL040 : '일시중지 행사입니다.',
			ESAL041 : '참여 가능한 회원등급이 아닙니다.',
			ESAL042 : '예치금 잔고가 부족합니다.',
			ESAL045 : '수취인 계좌가 없습니다.',
			ESAL046 : '이미 약관동의 하였습니다.',
			ESAL047 : '약관동의를 하지 않았습니다.',
			ESAL048 : '당첨 정보가 존재하지 않습니다.',
			ESAL049 : '시작 일자를 입력하세요.',
			ESAL050 : '종료 일자를 입력하세요.',
			ESAL053 : '진주알이 부족합니다.',
			ESAL054 : '죄송합니다. 잠시 후에 다시 이용해주세요.',
			ESAL055 : '진주알 정보가 없습니다. 고객센터에 문의해주세요.',
			ESAL056 : '이미 수령한 선물 포인트입니다.',
			ESAL058 : '증정대상이 없습니다.',
			ESAL059 : '이미 증정되었습니다.',
			EAPC001 : '모집이 종료되었습니다.',
			EAPC002 : '모집을 시작하지 않았습니다.',
			EAPC004 : '청춘강연 신청 시간이 아닙니다.'
		
	};

})( jQuery );